In [8]:
import pandas as pd
import numpy as np

In [9]:
ep = pd.read_csv('epi_sql.csv')  
ep.head()

,name,season,episode,air_date,characters
0,Pilot,1,1,"December 2, 2013","1, 2, 35, 38, 62, 92, 127, 144, 158, 175, 179,..."
1,Lawnmower Dog,1,2,"December 9, 2013","1, 2, 38, 46, 63, 80, 175, 221, 239, 246, 304,..."
2,Anatomy Park,1,3,"December 16, 2013","1, 2, 12, 17, 38, 45, 96, 97, 98, 99, 100, 101..."
3,M. Night Shaym-Aliens!,1,4,"January 13, 2014","1, 2, 38, 87, 175, 179, 181, 191, 239, 241, 27..."
4,Meeseeks and Destroy,1,5,"January 20, 2014","1, 2, 38, 41, 89, 116, 117, 120, 175, 193, 238..."

In [10]:
ep['characters'] = ep['characters'].str.split(',')
ep.head()

,name,season,episode,air_date,characters
0,Pilot,1,1,"December 2, 2013","[1, 2, 35, 38, 62, 92, 127, 144, 158, ..."
1,Lawnmower Dog,1,2,"December 9, 2013","[1, 2, 38, 46, 63, 80, 175, 221, 239, ..."
2,Anatomy Park,1,3,"December 16, 2013","[1, 2, 12, 17, 38, 45, 96, 97, 98, 99..."
3,M. Night Shaym-Aliens!,1,4,"January 13, 2014","[1, 2, 38, 87, 175, 179, 181, 191, 239..."
4,Meeseeks and Destroy,1,5,"January 20, 2014","[1, 2, 38, 41, 89, 116, 117, 120, 175,..."

In [11]:
ep = ep.explode('characters')
ep.head()

    name  season  episode          air_date characters
0  Pilot       1        1  December 2, 2013          1
0  Pilot       1        1  December 2, 2013          2
0  Pilot       1        1  December 2, 2013         35
0  Pilot       1        1  December 2, 2013         38
0  Pilot       1        1  December 2, 2013         62

In [12]:
ep.to_csv('ep_char.csv') # Locations table is stored

In [13]:
import mysql.connector
mydb = mysql.connector.connect(
  host="127.0.0.1",
  user="root",
  passwd="******",
  database = "rick_morty",
  auth_plugin='mysql_native_password'
)
cursor = mydb.cursor()
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001EE998ECC40>

In [16]:
cursor.execute("CREATE TABLE ep_char(name varchar(255),season int,episode int,air_date varchar(255),characters int)")

In [20]:
ep = pd.read_csv('ep_char.csv')
ep = ep.drop(columns = ["Unnamed: 0"])
for i,row in ep.iterrows():
            #here %S means string values 
            sql = "INSERT INTO rick_morty.ep_char VALUES (%s,%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            # the connection is not auto committed by default, so we must commit to save our changes
            mydb.commit()